frontend/widgets/hot/HotWidget.php

SELECT `a`.`browser`, `b`.`id`, `b`.`title` FROM `post_extends` `a` LEFT JOIN `posts` `b` ON a.post_id = b.id WHERE b.is_valid=1 ORDER BY `browser` DESC, `id` DESC LIMIT 6
---
    public function run()
    {
        $res = (new Query())
            ->select('a.browser, b.id, b.title')
            ->from(['a'=>PostExtendsModel::tableName()])
            ->join('LEFT JOIN', ['b'=>PostModel::tableName()], 'a.post_id = b.id')
            ->where('b.is_valid='.PostModel::IS_VALID)
            ->orderBy(['browser'=>SORT_DESC, 'id'=>SORT_DESC])
            ->limit($this->limit)
            ->all();