common/models/CatsModel.php

    public static function getAllCats()
    {
        $cat = ['0'=>'暂无'];
        $res = self::find()->asArray()->all();
---
SELECT * FROM `cats`