common/models/PostExtendsModel.php

SELECT * FROM `post_extends` WHERE `post_id`='15'
INSERT INTO `post_extends` (`post_id`, `browser`) VALUES (15, 1)
---
    public function upCounter($condition, $attribute, $num)
    {
        $counter = $this->findOne($condition);
        if(!$counter){
            $this->setAttributes($condition);
            $this->$attribute = $num;
            $this->save();