frontend/models/FeedForm.php

SELECT * FROM `feeds` ORDER BY `id` DESC LIMIT 10
SELECT * FROM `user` WHERE `id` IN ('561', '560')
---
    public function getList()
    {
        $model = new FeedsModel();
        $res = $model->find()
            ->limit(10)
            ->with('user')
            ->orderBy(['id'=>SORT_DESC])
            ->asArray()
            ->all();