frontend/models/PostForm.php

SELECT * FROM `post_extends` WHERE `post_id`='15'
SELECT * FROM `posts` WHERE `id`='15'
SELECT * FROM `tags` WHERE `id` IN ('2', '3')
---
    public function getViewById($id)
    {
        $res = PostModel::find()->with('relate.tag', 'extend')->where(['id'=>$id])->asArray()->one();