frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new UserModel();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;
---
INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('test01', '11@qq.com', '$2y$13$emxmXePL0zIxMqNzV0ZgAOkgeH5Cov2Dj8Xfi3n2PHmMxDVCklALy', '4Iv8Ul5anQ4pIjOgeR0yuB_5CZ6BBciF', 10, 1501145597, 1501145597)